I did some additional experimentation and it's possible to end up with this duplicate items in state even without deleting anything.  I think deletion is a more likely user scenario than the following, though.

Applying the following:
```terraform
resource "aiven_kafka" "test" {
  project                 = local.project_name
  plan                    = "startup-2"
  service_name            = "terraform-test"
}

resource "aiven_kafka" "test-2" {
  project                 = local.project_name
  plan                    = "startup-2"
  service_name            = "terraform-test"
}
```

Results in this plan:
```terraform
Terraform will perform the following actions:                                              
                                                                                           
  # aiven_kafka.test will be created                 
  + resource "aiven_kafka" "test" {                
      + components       = (known after apply)                                  
      + default_acl      = true                                               
      + id               = (known after apply)       
      + plan             = "startup-2"                     
      + project          = "***"               
      + service_host     = (known after apply)                                             
      + service_name     = "terraform-test"          
      + service_password = (sensitive value)                                               
      + service_port     = (known after apply)       
      + service_type     = (known after apply)       
      + service_uri      = (sensitive value)       
      + service_username = (known after apply)                                             
      + state            = (known after apply)     
                                                                                           
      + kafka {                                      
          + access_cert         = (sensitive value)
          + access_key          = (sensitive value)
          + connect_uri         = (sensitive value)  
          + rest_uri            = (sensitive value)  
          + schema_registry_uri = (sensitive value)
        }                                         
    }                                               
                                                                                           
  # aiven_kafka.test-2 will be created             
  + resource "aiven_kafka" "test-2" {                
      + components       = (known after apply)     
      + default_acl      = true                    
      + id               = (known after apply)       
      + plan             = "startup-2"             
      + project          = "***"              
      + service_host     = (known after apply)       
      + service_name     = "terraform-test"        
      + service_password = (sensitive value)       
      + service_port     = (known after apply)       
      + service_type     = (known after apply)     
      + service_uri      = (sensitive value)         
      + service_username = (known after apply)       
      + state            = (known after apply)       
                                                                                           
      + kafka {                                      
          + access_cert         = (sensitive value)  
          + access_key          = (sensitive value)
          + connect_uri         = (sensitive value)                             
          + rest_uri            = (sensitive value)                           
          + schema_registry_uri = (sensitive value)  
        }                                                  
    }                                                 
                                                                                           
Plan: 2 to add, 0 to change, 0 to destroy.
```

Which executes without any errors, leaving the state with:
```bash
$ terraform state list
tf state list
aiven_kafka.test
aiven_kafka.test-2

$ terraform state show aiven_kafka.test | grep id
    id                      = "***/terraform-test"
    
$ terraform state show aiven_kafka.test-2 | grep id
    id                      = "***/terraform-test"
```

If you run `terraform destroy`, it succesfully deletes the 1 resource from Aiven and removes the 2 resources from the state, so maybe this is more of a confusing than problematic bug.